In [22]:
import matplotlib.pyplot as plt
import pandas as pd
import numpy as np
import seaborn as sns

In [23]:
df=pd.read_csv('/Users/avinashmagar/Documents/Code/class/python/EDA/used_car_dataset.csv')
df

,Brand,model,Year,Age,kmDriven,Transmission,Owner,FuelType,PostedDate,AdditionInfo,AskPrice
0,Honda,City,2001,23,"98,000 km",Manual,second,Petrol,Nov-24,"Honda City v teck in mint condition, valid gen...","₹ 1,95,000"
1,Toyota,Innova,2009,15,190000.0 km,Manual,second,Diesel,Jul-24,"Toyota Innova 2.5 G (Diesel) 7 Seater, 2009, D...","₹ 3,75,000"
2,Volkswagen,VentoTest,2010,14,"77,246 km",Manual,first,Diesel,Nov-24,"Volkswagen Vento 2010-2013 Diesel Breeze, 2010...","₹ 1,84,999"
3,Maruti Suzuki,Swift,2017,7,"83,500 km",Manual,second,Diesel,Nov-24,Maruti Suzuki Swift 2017 Diesel Good Condition,"₹ 5,65,000"
4,Maruti Suzuki,Baleno,2019,5,"45,000 km",Automatic,first,Petrol,Nov-24,"Maruti Suzuki Baleno Alpha CVT, 2019, Petrol","₹ 6,85,000"
...,...,...,...,...,...,...,...,...,...,...,...
9577,Skoda,Octavia,2014,10,"105,904 km",Automatic,second,Diesel,Oct-24,"Skoda Octavia 1.9 Elegance TDI, 2014, Diesel","₹ 10,40,000"
9578,Maruti Suzuki,Alto-800,2020,4,"55,000 km",Manual,first,Hybrid/CNG,Nov-24,"Maruti Suzuki Alto 800 CNG LXI Optional, 2020,...","₹ 3,75,000"
9579,Maruti Suzuki,Ritz,2013,11,"92,000 km",Manual,first,Diesel,Nov-24,"Maruti Suzuki Ritz VDi, 2013, Diesel","₹ 4,15,000"
9580,Hyundai,Verna,2019,5,"72,000 km",Automatic,first,Petrol,Oct-24,"Hyundai Verna VTVT 1.6 AT SX Option, 2019, Petrol","₹ 8,55,000"
9581,Hyundai,New i20,2021,3,"83,228 km",Manual,second,Petrol,Nov-24,"Hyundai New i20 1.2 Asta IVT, 2021, Petrol","₹ 6,99,000"

In [24]:
df.head()

,Brand,model,Year,Age,kmDriven,Transmission,Owner,FuelType,PostedDate,AdditionInfo,AskPrice
0,Honda,City,2001,23,"98,000 km",Manual,second,Petrol,Nov-24,"Honda City v teck in mint condition, valid gen...","₹ 1,95,000"
1,Toyota,Innova,2009,15,190000.0 km,Manual,second,Diesel,Jul-24,"Toyota Innova 2.5 G (Diesel) 7 Seater, 2009, D...","₹ 3,75,000"
2,Volkswagen,VentoTest,2010,14,"77,246 km",Manual,first,Diesel,Nov-24,"Volkswagen Vento 2010-2013 Diesel Breeze, 2010...","₹ 1,84,999"
3,Maruti Suzuki,Swift,2017,7,"83,500 km",Manual,second,Diesel,Nov-24,Maruti Suzuki Swift 2017 Diesel Good Condition,"₹ 5,65,000"
4,Maruti Suzuki,Baleno,2019,5,"45,000 km",Automatic,first,Petrol,Nov-24,"Maruti Suzuki Baleno Alpha CVT, 2019, Petrol","₹ 6,85,000"

In [25]:
df.tail()

,Brand,model,Year,Age,kmDriven,Transmission,Owner,FuelType,PostedDate,AdditionInfo,AskPrice
9577,Skoda,Octavia,2014,10,"105,904 km",Automatic,second,Diesel,Oct-24,"Skoda Octavia 1.9 Elegance TDI, 2014, Diesel","₹ 10,40,000"
9578,Maruti Suzuki,Alto-800,2020,4,"55,000 km",Manual,first,Hybrid/CNG,Nov-24,"Maruti Suzuki Alto 800 CNG LXI Optional, 2020,...","₹ 3,75,000"
9579,Maruti Suzuki,Ritz,2013,11,"92,000 km",Manual,first,Diesel,Nov-24,"Maruti Suzuki Ritz VDi, 2013, Diesel","₹ 4,15,000"
9580,Hyundai,Verna,2019,5,"72,000 km",Automatic,first,Petrol,Oct-24,"Hyundai Verna VTVT 1.6 AT SX Option, 2019, Petrol","₹ 8,55,000"
9581,Hyundai,New i20,2021,3,"83,228 km",Manual,second,Petrol,Nov-24,"Hyundai New i20 1.2 Asta IVT, 2021, Petrol","₹ 6,99,000"

In [26]:
df.size

105402

In [27]:
df.shape

(9582, 11)

In [28]:
df.columns

Index(['Brand', 'model', 'Year', 'Age', 'kmDriven', 'Transmission', 'Owner',
       'FuelType', 'PostedDate', 'AdditionInfo', 'AskPrice'],
      dtype='object')

In [29]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9582 entries, 0 to 9581
Data columns (total 11 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Brand         9582 non-null   object
 1   model         9582 non-null   object
 2   Year          9582 non-null   int64
 3   Age           9582 non-null   int64
 4   kmDriven      9535 non-null   object
 5   Transmission  9582 non-null   object
 6   Owner         9582 non-null   object
 7   FuelType      9582 non-null   object
 8   PostedDate    9582 non-null   object
 9   AdditionInfo  9582 non-null   object
 10  AskPrice      9582 non-null   object
dtypes: int64(2), object(9)
memory usage: 823.6+ KB

In [30]:
df.describe()

              Year          Age
count  9582.000000  9582.000000
mean   2016.361094     7.638906
std       4.087226     4.087226
min    1986.000000     0.000000
25%    2014.000000     5.000000
50%    2017.000000     7.000000
75%    2019.000000    10.000000
max    2024.000000    38.000000

In [31]:
df.duplicated()

0       False
1       False
2       False
3       False
4       False
        ...
9577    False
9578    False
9579    False
9580    False
9581    False
Length: 9582, dtype: bool

In [32]:
df.duplicated().sum()

724

In [33]:
df.isnull()

,Brand,model,Year,Age,kmDriven,Transmission,Owner,FuelType,PostedDate,AdditionInfo,AskPrice
0,False,False,False,False,False,False,False,False,False,False,False
1,False,False,False,False,False,False,False,False,False,False,False
2,False,False,False,False,False,False,False,False,False,False,False
3,False,False,False,False,False,False,False,False,False,False,False
4,False,False,False,False,False,False,False,False,False,False,False
...,...,...,...,...,...,...,...,...,...,...,...
9577,False,False,False,False,False,False,False,False,False,False,False
9578,False,False,False,False,False,False,False,False,False,False,False
9579,False,False,False,False,False,False,False,False,False,False,False
9580,False,False,False,False,False,False,False,False,False,False,False
9581,False,False,False,False,False,False,False,False,False,False,False

In [34]:
df.isnull().sum()

Brand            0
model            0
Year             0
Age              0
kmDriven        47
Transmission     0
Owner            0
FuelType         0
PostedDate       0
AdditionInfo     0
AskPrice         0
dtype: int64

In [35]:
df['kmDriven'].isnull()

0       False
1       False
2       False
3       False
4       False
        ...
9577    False
9578    False
9579    False
9580    False
9581    False
Name: kmDriven, Length: 9582, dtype: bool

In [36]:
df['Transmission'].value_counts()

Transmission
Manual       4800
Automatic    4782
Name: count, dtype: int64

In [37]:
df['Owner'].value_counts()

Owner
first     4800
second    4782
Name: count, dtype: int64

In [38]:
df['AdditionInfo'].unique()

array(['Honda City v teck in mint condition, valid genuine car,',
       'Toyota Innova 2.5 G (Diesel) 7 Seater, 2009, Diesel',
       'Volkswagen Vento 2010-2013 Diesel Breeze, 2010, Diesel', ...,
       'Maruti Suzuki Alto 800 CNG LXI Optional, 2020, CNG & Hybrids',
       'Maruti Suzuki Ritz VDi, 2013, Diesel',
       'Hyundai New i20 1.2 Asta IVT, 2021, Petrol'], dtype=object)

In [39]:
df['Age'].nunique()

32

In [40]:
print(df['kmDriven'].dtype)

object

In [41]:
df.isnull().sum()/len(df)*100 # formula of calculate null value

Brand           0.000000
model           0.000000
Year            0.000000
Age             0.000000
kmDriven        0.490503
Transmission    0.000000
Owner           0.000000
FuelType        0.000000
PostedDate      0.000000
AdditionInfo    0.000000
AskPrice        0.000000
dtype: float64

In [42]:
df.isna().sum()

Brand            0
model            0
Year             0
Age              0
kmDriven        47
Transmission     0
Owner            0
FuelType         0
PostedDate       0
AdditionInfo     0
AskPrice         0
dtype: int64

In [43]:
df['kmDriven'].head()

0      98,000 km
1    190000.0 km
2      77,246 km
3      83,500 km
4      45,000 km
Name: kmDriven, dtype: object

In [44]:
df['kmDriven'] = df['kmDriven'].str.replace(',', '').str.strip()

In [45]:
df['kmDriven'] = df['kmDriven'].str.replace('.', '').str.strip()

In [46]:
df['kmDriven'] = df['kmDriven'].str.replace('km', '').str.strip()

In [47]:
print(df['kmDriven'])

0         98000
1       1900000
2         77246
3         83500
4         45000
         ...
9577     105904
9578      55000
9579      92000
9580      72000
9581      83228
Name: kmDriven, Length: 9582, dtype: object

In [48]:
df['kmDriven'] = df['kmDriven'].replace({'NA': 0, '-': 0})

In [49]:
df['kmDriven']=df['kmDriven'].astype(float)

In [50]:
df['kmDriven'].isna().sum()

47

In [51]:
print(df['kmDriven'].dtype)

float64

In [52]:
df['kmDriven'].fillna(df['kmDriven'].mean(),inplace=True)

/var/folders/5p/b13xgh3d2mlbcnqmgjp7bysr0000gn/T/ipykernel_4622/2219104209.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['kmDriven'].fillna(df['kmDriven'].mean(),inplace=True)

In [53]:
df['kmDriven'].isna().sum()

0

In [54]:
df.duplicated().sum()

724

In [55]:
gb=df.groupby('Brand').agg({'model':'count'})
gb

               model
Brand
Ambassador         3
Ashok              1
Aston Martin       1
Audi             264
BMW              342
Bajaj              2
Bentley            1
Chevrolet         89
Datsun            22
Fiat              22
Force              6
Ford             245
Honda            802
Hyundai         1529
ICML               1
Isuzu             10
Jaguar            34
Jeep              74
Kia              161
Land Rover        71
Lexus             20
MG                80
Mahindra         560
Maruti Suzuki   2720
Maserati           1
Mercedes-Benz    402
Mini              41
Mitsubishi        18
Nissan            75
Opel               2
Porsche           24
Renault          240
Rolls-Royce        2
Skoda            183
Ssangyong          2
Tata             389
Toyota           777
Volkswagen       318
Volvo             48

In [56]:
gb=df.groupby(['Brand','FuelType']).agg({'model':'count','Owner':'count'})
gb

                         model  Owner
Brand        FuelType
Ambassador   Diesel          1      1
             Petrol          2      2
Ashok        Hybrid/CNG      1      1
Aston Martin Petrol          1      1
Audi         Diesel        231    231
...                        ...    ...
Volkswagen   Hybrid/CNG     12     12
             Petrol        170    170
Volvo        Diesel         43     43
             Hybrid/CNG      1      1
             Petrol          4      4

[88 rows x 2 columns]

In [58]:
df['AskPrice'].dtype

dtype('O')